
Общие
Команда 	            Windows/Linux 	        Description
Preferences/Settings  	Ctrl + Alt + S 	        Открыть настройки программы
Switch tabs 	    	Ctrl + Tab      	    Переключение между открытыми вкладками
Search 	                Double Shift 	        Открыть окно поиска по проекту
New 	                Ctrl + N 	            Создать новый файл/Директорию
Save 	                Ctrl + S 	            Сохранить изменения в текущем файле
Save As 	        	Ctrl + Shift + S 	    Сохранить изменения в файле с новым именем
Close Tab 	        	Ctrl + F4 	            Закрыть текущую вкладку
Find in Path 	    	Ctrl + Shift + F 	    Поиск по всему проекту

Редактирование
Команда                Windows/Linux            Description
Find                    Ctrl + F                Поиск по файлу
Replace                 Ctrl + R                Замена найденных символов
Duplicate Lines         Ctrl + D                Создать дубликат текущей строки
Safe Delete 	    	Ctrl + Y 	            Удаление всей текущей строки
Select block 	    	Ctrl-W 	                Выделить блок кода (слово/строка/документ)
Move Block Up 	    	Ctrl + Shift + up 	    Переместить текущий блок кода вверх, на место предыдущего блока кода
Move Block Down 	 	Ctrl + Shift + down 	Переместить текущий блок кода вниз, на место следующего блока кода
Move Line Up 	    	ALT + Shift + up 	    Переместить текущую строку на одну строку вверх
Move Line Down 	    	ALT + Shift + down 	    Переместить текущую строку на одну строку вниз
Line comment 	    	Ctrl + / 	            Добавить строчный комментарий
Block comment 	    	Ctrl + Shift + / 	    Добавить блочный комментарий
Reformat code 	    	Ctrl + ALT + L 	        Восстанавливает форматирование кода, согласно настройкам
Multi select 	    	ALT + J + Click 	    Множественный курсор (нажать и немного подержать - выделит все вхождения)
Last Edition Location 	Ctrl + Shift + Backspace 	Вернуться к предыдущему месту редактирования

Горячие клавиши IDE PhpStorm

PDF Файл
Редактирование:
Windows/Linux 	                Описание
Ctrl + Space 	                Вывод возможных вариантов автодополнения
Alt + Enter 	                Показывает меню с доступными действиями и быстрыми решениями
Ctrl + P 	                    Информация о параметре (в пределах аргументов вызова метода)
Ctrl + Q            	        Быстрый поиск по документации
Ctrl + Курсор мыши над кодом 	Краткая информация
Alt + Insert 	                Сгенерировать код... (getter-ы, setter-ы, конструкторы)
Ctrl + O 	                    Переопределение методов
Ctrl + I 	                    Реализация методов
Ctrl + Alt + T 	                Окружить... (if..else, try..catch, for и т.д.)
Ctrl + / 	                    Вставить / Удалить строковый комментарий
Ctrl + Shift + / 	            Вставить / Удалить многосторочный комментарий
Ctrl + W 	                    Выборка последовательно возрастающих блоков кода
Ctrl + Shift + W 	            Вернуть текущую выборку в предыдущее состояние
Ctrl + Alt + L 	                Переформатировать код
Ctrl + Alt + I 	                Автоотступ строки
Ctrl + D 	                    Продублировать текущую строку или выбранный блок
Ctrl + Y 	                    Удалить строку, на которой установлен курсор
Ctrl + Shift + J 	            Интеллектуальная склейка строк (только для HTML и JavaScript)
Ctrl + Enter 	                Интеллектуальная разбивка строк (только для HTML и JavaScript)
Shift + Enter 	                Начать новую строку
Ctrl + Shift + U 	            Переключить регистр для слова под курсором или выбранного блока
Ctrl + Shift + ] / [ 	        Выбрать код до конца/начала блока
Ctrl + Delete 	                Удалить до конца слова
Ctrl + Backspace 	            Удалить до начала слова
Ctrl + NumPad+/- 	            Развернуть / Свернуть блок кода
Ctrl + F4 	                    Закрыть активную вкладку редактора
Ctrl + Shift + V 	            Вставить из истории

Отладка:
Windows/Linux 	                Описание
F8 	                            Шаг с обходом
F7 	                            Шаг с заходом
Shift + F8 	                    Шаг с выходом
Alt + F8 	                    Вычислить выражение
F9 	                            Продолжить выполнение программы
Ctrl + F8 	                    Установить или снять контрольную точку
Ctrl+Shift+F8 	                Просмотр контрольных точек

Выполнение:
Windows/Linux 	                Описание
Shift + F10 	                Выполнить
Shift + F9 	                    Отладить
Ctrl + Shift + F10 	            Выбрать конфигурацию и запустить
Ctrl + Shift + X 	            Открыть командную строку

Поиск и замена:
Windows/Linux 	                Описание
Ctrl + F/R 	                    Найти / Заменить
F3/Shift + F3 	                Найти следующее / предыдущее
Ctrl + Shift + F/R 	            Найти / Заменить в директории

Поиск случаев использования:
Windows/Linux 	                Описание
Alt + F7 / Ctrl + F7 	        Найти случаи использования / найти случаи использования в файле
Ctrl + Shift + F7 	            Выделить случаи использования
Ctrl + Alt + F7 	            Показать случаи использования

Навигация:
Windows/Linux 	                Описание
Ctrl + N 	                    Перейти к классу
Ctrl + Shift + N 	            Перейти к файлу
Ctrl + Alt + Shift + N 	        Перейти к символу
Ctrl + G 	                    Перейти к строке
Alt + Right/Left 	            Переход к следующей / предыдущей вкладки редактора
Esc 	                        Перейти в редактор (из окна инструментов)
Ctrl + E 	                    Открыть всплывающее окно с последними использовавшимися файлами
Ctrl + Alt + Left/Right 	    Перейти назад / вперед
Ctrl + Shift + Backspace 	    Перейти к месту последнего редактирования
Alt + F1 	                    Выбрать текущий файл или символ в любой области просмотра
Ctrl + B или Ctrl + Click 	    Перейти к объявлению
Ctrl + Alt + B 	                Перейти к реализации
Ctrl + Shift + I 	            Открыть быстрый поиск по определению
Ctrl + Shift + B 	            Перейти к объявлению типа
Ctrl + U 	                    Перейти к родительскому методу / классу
Alt + Up/Down 	                Переход к предыдущему / следующему методу
Ctrl + ] / [ 	                Перейти в конец / начало блока
F2 / Shift + F2 	            Следующая / Предыдущая выделенная ошибка
F4 / Ctrl + Enter 	            Редактировать файл / Просмотр файла

Реорганизация (Рефакторинг) кода:
Windows/Linux 	                Описание
F5/F6 	                        Скопировать / Переместить
Alt + Delete 	                Безопасное удаление
Shift + F6 	                    Переименовать
Ctrl + Alt + N 	                Встраиваемая переменная
Ctrl + Alt + M/V/F/C 	        Перенести в метод или функцию / переменную /свойство класса / константу
Ctrl + Alt + Shift + T 	        Реорганизовать (отображает все возможные варианты реорганизации)

Система контроля версиями/Локальная история:
Windows/Linux 	                Описание
Alt + Обратная кавычка (`) 	    Вспдывающие окно СКВ
Ctrl + K 	                    Фиксация (коммит) проекта в СКВ
Ctrl + T 	                    Обновление проекта из СКВ
Alt + Shift + C 	            Просмотр последних изменений

Общие команды:
Windows/Linux 	                Описание
Двойное нажатие Shift 	        Поиск везде
Ctrl + Shift + A 	            Найти действие
Alt + #[0-9] 	                Открыть соответствующее окно инструментария
Ctrl + Alt + F11 	            Переключиться в полноэкранный режим
Ctrl + Shift + F12 	            Развернуть окно редактора
Alt + Shift + F 	            Добавить в избранное
Alt + Shift + I 	            Проверить текущий файл с текущим профилем
Ctrl + Alt + S 	                Открыть окно настройки параметров
Ctrl + Tab 	                    Переключение между вкладками и окном инструментария

Сниппеты:
Windows/Linux 	                Описание
Ctrl + J 	                    Вставить шаблон из списка
eco 	                        Выражение 'echo'
fore 	                        foreach(iterable_expr as $value) {...}
forek 	                        foreach(iterable_expr as $key => $value) {...}
inc/inco 	                    Выражение 'include'/'include_once'
prif 	                        Закрытый (private) метод
prof 	                        Защищённый (protected) метод
pubf 	                        Открытый (public) метод
rqr/rqro 	                    Выражение 'require'/'require_once'
Для поиска какого-либо действия в интегрированной среде разработки воспользуйтесь поиском действия (Ctrl + Shift + A)

